import datetime as dt
import math


# Конфигурационный файл

# Стартовые размеры окна [пиксели]
WINDOW_WIDTH = 500
WINDOW_HEIGHT = 500

# Ширина орбит [пиксели]
ORBIT_LINEWIDTH = 1

MASS_CENTER_SIZE = 12

# Размер планет
PLANET_SIZE = 12

# Стартовый масштаб
SCALE = 5

MIN_SCALE, MAX_SCALE = 0.05, 300

MASS_CENTER_LINEWIDTH = 1

# Стартовая частота отрисовки
FPS = 60

# Количество земных дней проходящих за секунду использования программы
TIME_SEC = dt.timedelta(days=90)

# Частота обновления надписи с текущим временем в секунду
DATE_LABEL_REFRESH_RATE = 2

START_DATE = dt.datetime(2000, 1, 1, 12, 0)

# Мультипликатор масштаба при управлении колесиком
SCROLL_SCALE_VALUE = 1.2

# Стартовые положения планет на орбитах [радианы]
START_POS = [
	(253.7775715 * math.pi / 180), # Меркурий
	(182.5973672 * math.pi / 180), # Венера
	(100.3727907 * math.pi / 180), # Земля
	(359.4427173 * math.pi / 180), # Марс
	(36.2920523 * math.pi / 180), # Юпитер
	(45.7203432 * math.pi / 180), # Сатурн
	(316.4173959 * math.pi / 180), # Уран
	(303.9278287 * math.pi / 180), # Нептун
	(250.5450920 * math.pi / 180) # Плутон
]

