# Константы

# --- Радиусы орбит [а. е.] ---
RADIUSES = [
	0.387, # Меркурий
	0.723, # Венера
	1., # Земля
	1.524, # Марс
	5.2, # Юпитер
	9.58, # Сатурн
	19.19, # Уран
	30.1, # Нептун
	39.48 # Плутон
]

#-----------------------------


# --- Период вращения вокруг Солнца [земной день] ---
PERIODS = [
	87.97, # Меркурий
	224.7, # Венера
	365.256, # Земля
	686.98, # Марс
	4332.59, # Юпитер
	10756, # Сатурн
	30688, # Уран
	60190, # Нептун
	90560 # Плутон
]

#------------------------------


# --- Масса планет [10^25 kg] ---
MASSES = [
	0.0033, # Меркурий
	0.487, # Венера
	0.597, # Земля
	0.064, # Марс
	189.813, # Юпитер
	56.846, # Сатурн
	8.681, # Уран
	10.24, # Нептун
	0.001 # Плутон	
]

#-------------------------------

