import datetime as dt
from skyfield.api import load
import utils


ts = load.timescale()


SATURN_DATA = {
	1400: {
		'perihelion': ts.tdb_jd(2237551.693605642766),
		'eccentricity': 0.0578,
		'angle': 90.6852962,
		'radius': 1430002600.72253,
		'period': dt.timedelta(days=10793.28088602765)
	},
	1500: {
		'perihelion': ts.tdb_jd(2269763.367631230969),
		'eccentricity': 0.0602,
		'angle': 87.8108300,
		'radius': 1431155803.116403,
		'period': dt.timedelta(days=10806.33961724900)
	},
	1600: {
		'perihelion': ts.tdb_jd(2302249.348228134681),
		'eccentricity': 0.0577,
		'angle': 94.7673491,
		'radius': 1432068614.473046,
		'period': dt.timedelta(days=10816.67991934380)
	},
	1800: {
		'perihelion': ts.tdb_jd(2377563.568153410684),
		'eccentricity': 0.0596,
		'angle': 93.9347803,
		'radius': 1433826895.890101,
		'period': dt.timedelta(days=10836.60697138529)
	},
	2000: {
		'perihelion': ts.tdb_jd(2452738.073455885984),
		'eccentricity': 0.0557,
		'angle': 89.7304950,
		'radius': 1433449772.231375,
		'period': dt.timedelta(days=10832.33190288165)
	},
	2200: {
		'perihelion': ts.tdb_jd(2528035.491747999098),
		'eccentricity': 0.054,
		'angle': 89.7704295,
		'radius': 1434009993.824530,
		'period': dt.timedelta(days=10838.68276976172)
	},
	2400: {
		'perihelion': ts.tdb_jd(2592707.958766771480),
		'eccentricity': 0.0521,
		'angle': 93.5943525,
		'radius': 1433139903.147183,
		'period': dt.timedelta(days=10828.81965212955)
	},
	2600: {
		'perihelion': ts.tdb_jd(2668274.189477163833),
		'eccentricity': 0.0527,
		'angle': 101.6926241,
		'radius': 1432887594.692481,
		'period': dt.timedelta(days=10825.96011013010)
	}
}

MOON_PERIHELION = ts.tdb_jd(2451533.965359285008)
MOON_ECCENTRICITY = 0.0549
MOON_ANGLE = 71.0662430
MOON_RADIUS = 384400
MOON_PERIOD = dt.timedelta(days=27.321582)
MOON_MASS = 0.007

PERIHELION = [
	ts.tdb_jd(2451502.287121773232), # Меркурий
	ts.tdb_jd(2451513.720262355171), # Венера
	ts.tdb_jd(2451546.403877782170), # Земля
	ts.tdb_jd(2451508.062923341058), # Марс
	ts.tdb_jd(2451318.454493310302), # Юпитер
	ts.tdb_jd(2452735.770633314736), # Сатурн
	ts.tdb_jd(2439319.660706136841), # Уран
	ts.tdb_jd(2467271.980002022348) # Нептун
]


ECCENTRICITIES = [
	0.2056, # Меркурий
	0.0068, # Венера
	0.017, # Земля
	0.0933, # Марс
	0.0488, # Юпитер
	0.0556, # Сатурн
	0.04439, # Уран
	0.0112 # Нептун
]

ANGLES = [
	77.2619598, # Меркурий
	131.810487, # Венера
	101.8032153, # Земля
	336.1026475, # Марс
	15.5595535, # Юпитер
	89.6445658, # Сатурн
	169.6960884, # Уран
	38.8370468 # Нептун
]

# --- Радиусы орбит [km] ---
RADIUSES = [
	57909068.29452708, # Меркурий
	108208168.1709291, # Венера
	149665014.5528626, # Земля
	227939132.9739321, # Марс
	778557615.6961257, # Юпитер
	1433436205.589770, # Сатурн
	2876789143.055653, # Уран
	4501986736.248356, # Нептун
]

#-----------------------------


# --- Период вращения вокруг Солнца [земной день] ---
PERIODS = [
	dt.timedelta(days=87.969257), # Меркурий
	dt.timedelta(days=224.70079922), # Венера
	dt.timedelta(days=365.25636), # Земля
	dt.timedelta(days=686.98), # Марс
	dt.timedelta(days=4332.589), # Юпитер
	dt.timedelta(days=10755.698), # Сатурн
	dt.timedelta(days=30685.4), # Уран
	dt.timedelta(days=60189), # Нептун
]

#------------------------------


# --- Масса планет [10^25 kg] ---
MASSES = [
	0.0033, # Меркурий
	0.48685, # Венера
	0.597, # Земля
	0.0642, # Марс
	189.819, # Юпитер
	56.834, # Сатурн
	8.681, # Уран
	10.241, # Нептун
]

#-------------------------------

#-------------------------------
PLANET_NAMES = [
	'Меркурий',
	'Венера',
	'Земля',
	'Марс',
	'Юпитер',
	'Сатурн',
	'Уран',
	'Нептун'
]
#-------------------------------

#-------------------------------
PLANET_NAMES_ENG = ["Mercury", "Venus", "Earth", "Mars", "Jupiter", "Saturn", "Uranus", "Neptune"]

#-------------------------------
